{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-2c7d79a87289>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "cropping": [[70, 20], [0, 0]], "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_1", "nb_filter": 24, "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "nb_row": 5, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_2", "nb_filter": 32, "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "nb_row": 5, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_3", "nb_filter": 48, "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "nb_row": 5, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "nb_col": 3, "nb_row": 3, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "border_mode": "valid", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "nb_col": 3, "nb_row": 3, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "input_dim": 4224, "output_dim": 100, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "input_dim": 100, "output_dim": 50, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.4}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_3", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "input_dim": 50, "output_dim": 10, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_4", "bias": true, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "input_dim": 10, "output_dim": 1, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}}]}